#language: ru
Функционал: Страхование


  Сценарий: Заявка на страхование путешественников

    Когда выбран пункт меню "Страхование"
    И выбран вид страхования "Путешествия и покупки"

    Тогда заголовок страницы - Путешествия и покупки равен "Страхование путешественников"

    Когда выполнено нажатие на кнопку Оформить онлайн
    Когда выполнить переход на новую вкладку

    Тогда заголовок страницы - Страхование путешественников равен "Страхование путешественников"

    Когда выполнить нажатие на кнопку Минимальная
    Когда выполнить нажатие на кнопку Оформить

    Тогда появилось поле на вкладке Оформление равное "Введите данные застрахованных латинскими буквами, как в загранпаспорте"


    Когда заполняются поля:
      | первая фамилия | Ivanov   |
      | первое имя     | Ivan     |
      | первая др      | 01011980 |
      | фамилия        | фамилия  |
      | имя            | имя      |
      | отчество       | отчество |
      | др             | 01011980 |
      | серия          | 1234     |
      | номер          | 123456   |
      | дата           | 01012015 |
      | кем            | кем      |

    Когда выполнить нажатие на кнопку Продолжить

    Тогда значения полей равны:
      | первая фамилия | Ivanov     |
      | первое имя     | Ivan       |
      | первая др      | 01.01.1980 |
      | фамилия        | Фамилия    |
      | имя            | Имя        |
      | отчество       | Отчество   |
      | др             | 01.01.1980 |
      | серия          | 1234       |
      | номер          | 123456     |
      | дата           | 01.01.2015 |
      | кем            | кем        |

    И присутствует сообщение об ошибке "Заполнены не все обязательные поля"
